In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data/EDA_nas.csv")

In [3]:
df.head()

,STUID,State,District,Gender,Age,Category,Same.language,Siblings,Handicap,Father.edu,...,Express.science.views,Watch.TV,Read.magazine,Read.a.book,Play.games,Help.in.household,Maths..,Reading..,Science..,Social..
0,26011001001,Maharashtra,1,Girl,13 years,3.0,2.0,1 sibling,No,Illiterate,...,Agree,Every day,Never,Once a month,Once a week,Every day,NaN,33.33,NaN,NaN
1,26011001002,Maharashtra,1,Girl,15 years,3.0,2.0,3 siblings,No,NaN,...,Agree,Once a week,Never,Never,Once a week,Every day,NaN,62.07,NaN,NaN
2,26011001003,Maharashtra,1,Girl,14 years,3.0,2.0,3 siblings,No,Degree & above,...,Agree,Every day,Once a month,Once a month,Once a week,Every day,NaN,41.38,NaN,NaN
3,26011001004,Maharashtra,1,Boy,13 years,3.0,2.0,3 siblings,No,Secondary,...,Agree,Every day,Every day,Never,Every day,Every day,29.82,NaN,NaN,NaN
4,26011001005,Maharashtra,1,Girl,14 years,3.0,2.0,2 siblings,No,Primary,...,Neither,Never,Never,Once a month,Once a week,Every day,NaN,NaN,27.27,NaN

In [4]:
df.columns

Index(['STUID', 'State', 'District', 'Gender', 'Age', 'Category',
       'Same.language', 'Siblings', 'Handicap', 'Father.edu', 'Mother.edu',
       'Father.occupation', 'Mother.occupation', 'Below.poverty',
       'Use.calculator', 'Use.computer', 'Use.Internet', 'Use.dictionary',
       'Read.other.books', 'X..Books', 'Distance', 'Computer.use',
       'Library.use', 'Like.school', 'Subjects', 'Give.Lang.HW',
       'Give.Math.HW', 'Give.Scie.HW', 'Give.SoSc.HW', 'Correct.Lang.HW',
       'Correct.Math.HW', 'Correct.Scie.HW', 'Correct.SocS.HW',
       'Help.in.Study', 'Private.tuition', 'English.is.difficult',
       'Read.English', 'Dictionary.to.learn', 'Answer.English.WB',
       'Answer.English.aloud', 'Maths.is.difficult', 'Solve.Maths',
       'Solve.Maths.in.groups', 'Draw.geometry', 'Explain.answers',
       'SocSci.is.difficult', 'Historical.excursions', 'Participate.in.SocSci',
       'Small.groups.in.SocSci', 'Express.SocSci.views',
       'Science.is.difficult', 'Observe.experiments', 'Conduct.experiments',
       'Solve.science.problems', 'Express.science.views', 'Watch.TV',
       'Read.magazine', 'Read.a.book', 'Play.games', 'Help.in.household',
       'Maths..', 'Reading..', 'Science..', 'Social..'],
      dtype='object')

In [12]:
# Watch.TVs
dfScience = df[['Watch.TV', 'Science..', 'Science.is.difficult', 'Solve.science.problems', 'Express.science.views']]
dfScience.head()

,Watch.TV,Science..,Science.is.difficult,Solve.science.problems,Express.science.views
0,Every day,NaN,Disagree,Agree,Agree
1,Once a week,NaN,Disagree,Agree,Agree
2,Every day,NaN,Disagree,Agree,Agree
3,Every day,NaN,Agree,Agree,Agree
4,Never,27.27,Disagree,Disagree,Neither

In [19]:
dfOnceAWeek = dfScience[dfScience['Watch.TV']=="Once a week"]
dfEveryDay = dfScience[dfScience['Watch.TV']=="Every day"]
dfOnceAMonth = dfScience[dfScience['Watch.TV']=="Once a month"]
dfNever = dfScience[dfScience['Watch.TV']=="Never"]

In [18]:
dfScience['Watch.TV'].value_counts()

Every day       6621
Once a week     1479
Never            348
Once a month     309
Name: Watch.TV, dtype: int64

In [20]:
dfEveryDay.describe()

         Science..
count  3113.000000
mean     36.357915
std      13.184537
min       0.000000
25%      27.270000
50%      34.550000
75%      43.640000
max      85.450000

In [21]:
dfOnceAWeek.describe()

        Science..
count  703.000000
mean    36.467112
std     13.202579
min      1.820000
25%     27.270000
50%     34.550000
75%     42.730000
max     80.000000

In [22]:
dfOnceAMonth.describe()

        Science..
count  142.000000
mean    36.786127
std     12.880244
min     16.360000
25%     27.270000
50%     34.550000
75%     41.820000
max     74.550000

In [23]:
dfNever.describe()

        Science..
count  163.000000
mean    35.638589
std     13.387458
min      7.270000
25%     26.360000
50%     32.730000
75%     41.820000
max     76.360000

In [24]:
dfMath = df[['Father.edu', 'Maths..']]

In [25]:
dfMath.head()

       Father.edu  Maths..
0      Illiterate      NaN
1             NaN      NaN
2  Degree & above      NaN
3       Secondary    29.82
4         Primary      NaN

In [28]:
dfMath['Father.edu'].value_counts()

Secondary         2549
Primary           2434
Illiterate        2034
Sr secondary       792
Degree & above     338
Name: Father.edu, dtype: int64

In [29]:
dfMathPrimary = dfMath[dfMath["Father.edu"] == "Primary"]
dfMathSecondary = dfMath[dfMath["Father.edu"] == "Secondary"]
dfMathIlliterate = dfMath[dfMath["Father.edu"] == "Illiterate"]
dfMathSrSecondary = dfMath[dfMath["Father.edu"] == "Sr secondary"]
dfMathDegreeANDabove = dfMath[dfMath["Father.edu"] == "Degree & above"]

In [34]:
dfMathPrimary.mean()

Maths..    32.561137
dtype: float64

In [35]:
dfMathSecondary.mean()

Maths..    32.230393
dtype: float64

In [36]:
dfMathIlliterate.mean()

Maths..    29.126754
dtype: float64

In [37]:
dfMathSrSecondary.mean()

Maths..    32.493415
dtype: float64

In [38]:
dfMathDegreeANDabove.mean()

Maths..    34.879193
dtype: float64

In [40]:
# What is the impact of 'Play.Games' on Reading marks?
df.columns

Index(['STUID', 'State', 'District', 'Gender', 'Age', 'Category',
       'Same.language', 'Siblings', 'Handicap', 'Father.edu', 'Mother.edu',
       'Father.occupation', 'Mother.occupation', 'Below.poverty',
       'Use.calculator', 'Use.computer', 'Use.Internet', 'Use.dictionary',
       'Read.other.books', 'X..Books', 'Distance', 'Computer.use',
       'Library.use', 'Like.school', 'Subjects', 'Give.Lang.HW',
       'Give.Math.HW', 'Give.Scie.HW', 'Give.SoSc.HW', 'Correct.Lang.HW',
       'Correct.Math.HW', 'Correct.Scie.HW', 'Correct.SocS.HW',
       'Help.in.Study', 'Private.tuition', 'English.is.difficult',
       'Read.English', 'Dictionary.to.learn', 'Answer.English.WB',
       'Answer.English.aloud', 'Maths.is.difficult', 'Solve.Maths',
       'Solve.Maths.in.groups', 'Draw.geometry', 'Explain.answers',
       'SocSci.is.difficult', 'Historical.excursions', 'Participate.in.SocSci',
       'Small.groups.in.SocSci', 'Express.SocSci.views',
       'Science.is.difficult', 'Observe.experiments', 'Conduct.experiments',
       'Solve.science.problems', 'Express.science.views', 'Watch.TV',
       'Read.magazine', 'Read.a.book', 'Play.games', 'Help.in.household',
       'Maths..', 'Reading..', 'Science..', 'Social..'],
      dtype='object')

In [41]:
dfScoreAna = df[['Play.games', 'Reading..', ]]

In [42]:
dfScoreAna['Play.games'].value_counts()

Every day       6252
Once a week     1826
Once a month     350
Never            329
Name: Play.games, dtype: int64

In [44]:
dfPGED = dfScoreAna[dfScoreAna["Play.games"] == "Every day"]
dfOAK = dfScoreAna[dfScoreAna["Play.games"] == "Once a week"]
dfOAM = dfScoreAna[dfScoreAna["Play.games"] == "Once a month"]
dfN = dfScoreAna[dfScoreAna["Play.games"] == "Never"]

In [45]:
dfPGED.mean()

Reading..    54.780136
dtype: float64

In [46]:
dfOAK.mean()

Reading..    59.627034
dtype: float64

In [47]:
dfOAM.mean()

Reading..    51.951193
dtype: float64

In [48]:
dfN.mean()

Reading..    49.107484
dtype: float64

### Segmented Analysis

You are supposed to use the above-attached sample data set of class VIII students of Maharashtra state to attempt the following questions.

The variable ‘Solve.Maths’ has three levels - agree, disagree, neither which indicates whether the child solves math problems regularly.

Is there any significant difference in the mean of percentage maths marks among the students who agree or disagree on ‘Solve.Maths’? Write your answer in the text box below.

In [52]:
dfMath = df[['Solve.Maths', 'Maths..']]

In [54]:
dfMath.head()

  Solve.Maths  Maths..
0       Agree      NaN
1       Agree      NaN
2       Agree      NaN
3    Disagree    29.82
4     Neither      NaN

In [55]:
dfSMAgree = dfMath[dfMath["Solve.Maths"] == "Agree"]
dfSMDisAgree = dfMath[dfMath["Solve.Maths"] == "Disagree"]

In [56]:
dfSMAgree.describe()

           Maths..
count  2109.000000
mean     32.800920
std      15.927269
min       1.750000
25%      22.030000
50%      28.070000
75%      38.600000
max      94.740000

In [57]:
dfSMDisAgree.describe()

           Maths..
count  1514.000000
mean     30.841321
std      13.226281
min       0.000000
25%      22.810000
50%      27.120000
75%      35.090000
max      91.230000